# 配置文件
DIFY_API_URL = "https://api.dify.ai/v1/chat-messages"
CONVERSATION_LOG_FILE = "conversation_log.json"
DIFY_API_KEY = "app-tlk6fbWn6Y228DBTlLRMyxvY"

BASE_URL="https://api.moonshot.cn/v1"
API_KEY="sk-GOGKIAEeltGusXyrtO4ts60erupjWX9wEgb3AouNnFVz8LCb"

OPENAI_API_KEY = "sk-1ddd28a0c2184057a7aff10f6d5640f4"
OPENAI_API_BASE = "https://api.deepseek.com/v1"


ALLOWED_ASSETS = ["A股", "债券", "REITs", "港股", "美股", "黄金", "大宗商品"]
DEFAULT_ASSETS = ["股票", "债券", "房地产信托"]
ASSET_MAPPING = {
    "股票": "A股",
    "A股": "A股",
    "债券": "债券",
    "房地产信托": "REITs",
    "REITs": "REITs",
    "港股": "港股",
    "美股": "美股",
    "黄金": "黄金",
    "大宗商品": "大宗商品"
}


COV_MATRIX = [
            [0.044479, 0.031437, 0.004414],
            [0.031437, 0.264196, 0.004965],
            [0.004414, 0.004965, 0.025921]
            ]

PRESET_COVARIANCE = {
                    "A股": {"A股": 0.044479, "债券": 0.031437, "REITs": 0.004414, "港股": 0.020851, "美股": 0.003474, "黄金": 0.002532, "大宗商品": -0.000609},
                    "债券": {"A股": 0.031437, "债券": 0.264196, "REITs": 0.004965, "港股": -0.024757, "美股": -0.007815, "黄金": -0.003858, "大宗商品": -0.01188},
                    "REITs": {"A股": 0.004414, "债券": 0.004965, "REITs": 0.025921, "港股": -0.000408, "美股": 0.000408, "黄金": 0.001208, "大宗商品": 0.001395},
                    "港股": {"A股": 0.020851, "债券": -0.024757, "REITs": -0.000408, "港股": 0.064262, "美股": 0.004175, "黄金": 0.007991, "大宗商品": 0.013183},
                    "美股": {"A股": 0.003474, "债券": -0.007815, "REITs": 0.000408, "港股": 0.004175, "美股": 0.016053, "黄金": 0.004564, "大宗商品": 0.002928},
                    "黄金": {"A股": 0.002532, "债券": -0.003858, "REITs": 0.001208, "港股": 0.007991, "美股": 0.004564, "黄金": 0.02253, "大宗商品": 0.009974},
                    "大宗商品": {"A股": -0.000609, "债券": -0.01188, "REITs": 0.001395, "港股": 0.013183, "美股": 0.002928, "黄金": 0.009974, "大宗商品": 0.083463}
                    }